html/org-pages/qc1/week22.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-12-19 Mon 09:48 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Week 22 - my notes</title>
<meta name="author" content="Luís Spengler" />
<meta name="description" content="Week 22 - my notes" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://luispengler.github.io/site/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://luispengler.github.io/site/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Week 22 - my notes</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgaf58ffc">Week 22 - Types of Qubits and Intro to Near-Term Algorithms</a>
<ul>
<li><a href="#org642af85">Superconducting Qubits</a></li>
<li><a href="#org7d4a575">Photonic Qubits</a></li>
<li><a href="#org09ccccb">Guest</a></li>
<li><a href="#orgdc007d3">Near-term algorithms</a></li>
<li><a href="#orgeb5dbe6">Tunable Quantum Circuits</a></li>
</ul>
</li>
<li><a href="#org8e7407a">Resources</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgaf58ffc" class="outline-2">
<h2 id="orgaf58ffc">Week 22 - Types of Qubits and Intro to Near-Term Algorithms</h2>
<div class="outline-text-2" id="text-orgaf58ffc">
</div>
<div id="outline-container-org642af85" class="outline-3">
<h3 id="org642af85">Superconducting Qubits</h3>
<div class="outline-text-3" id="text-org642af85">
</div>
<div id="outline-container-org20820ea" class="outline-4">
<h4 id="org20820ea">Pros</h4>
<div class="outline-text-4" id="text-org20820ea">
<ul class="org-ul">
<li>It&rsquo;s on a chip</li>
<li>Microwave technology is well developed</li>
<li>High quality gates and readout</li>
</ul>
</div>
</div>
<div id="outline-container-orgc89d500" class="outline-4">
<h4 id="orgc89d500">Cons</h4>
<div class="outline-text-4" id="text-orgc89d500">
<ul class="org-ul">
<li>Require cooling to mK temperatures</li>
<li>Loss to substrate material</li>
<li>Need bigger dilution</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org7d4a575" class="outline-3">
<h3 id="org7d4a575">Photonic Qubits</h3>
<div class="outline-text-3" id="text-org7d4a575">
</div>
<div id="outline-container-org2cb828c" class="outline-4">
<h4 id="org2cb828c">Pros</h4>
<div class="outline-text-4" id="text-org2cb828c">
<ul class="org-ul">
<li>Room temperature</li>
<li>Compatible with existing fabrication infrastructure</li>
<li>Uses photonic technology which is well-developed</li>
<li>Low single-photon error rates</li>
</ul>
</div>
</div>
<div id="outline-container-org0c47560" class="outline-4">
<h4 id="org0c47560">Cons</h4>
<div class="outline-text-4" id="text-org0c47560">
<ul class="org-ul">
<li>Entanglement is difficult (photons don&rsquo;t interact with each other easily)</li>
<li>Single photon generation is unreliable</li>
<li>Superconducting detectors require cooling to K temperatures</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org09ccccb" class="outline-3">
<h3 id="org09ccccb">Guest</h3>
<div class="outline-text-3" id="text-org09ccccb">
</div>
<div id="outline-container-orgbcf3794" class="outline-4">
<h4 id="orgbcf3794">Rydberg Atom Qubits</h4>
<div class="outline-text-4" id="text-orgbcf3794">
<ul class="org-ul">
<li>Relativily new type of qubit</li>
<li>Each atom is a qubit</li>
<li>We use the shell of the electron to identify different states</li>
<li>The types of atoms used are called neutral atom: atoms with only one atom in the valence</li>
<li>If  the valence electron is where it should be, it&rsquo;s \[|0\rangle\] if it&rsquo;s not, it&rsquo;s \[|1\rangle\]</li>
</ul>
</div>
</div>
<div id="outline-container-orga954437" class="outline-4">
<h4 id="orga954437">How do you hold atoms in the right locations?</h4>
<div class="outline-text-4" id="text-orga954437">
<ul class="org-ul">
<li>Optical tweezers are used to hold the atoms in place. It is even possible to create an array of atoms</li>
</ul>
</div>
</div>
<div id="outline-container-org2fdf082" class="outline-4">
<h4 id="org2fdf082">Pros</h4>
<div class="outline-text-4" id="text-org2fdf082">
<ul class="org-ul">
<li>Large number of qubits</li>
<li>Customizable qubit locations</li>
<li>High decoherence time</li>
</ul>
</div>
</div>
<div id="outline-container-org18cf1b0" class="outline-4">
<h4 id="org18cf1b0">Cons</h4>
<div class="outline-text-4" id="text-org18cf1b0">
<ul class="org-ul">
<li>Physical crowding limits single-qubit gates</li>
<li>High error rates for ~2 qubit gates</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgdc007d3" class="outline-3">
<h3 id="orgdc007d3">Near-term algorithms</h3>
<div class="outline-text-3" id="text-orgdc007d3">
<ul class="org-ul">
<li>Designed to work on NISQ (Noisy Intermidiate-Scale Quantum) technology</li>
<li>It is used by leveraging quantum computers alongside classical ones</li>
<li>We don&rsquo;t know about advantages in near-term algorithms over classical ones</li>
<li>These algortihms are also called hybrid algorithms (bc of quantum + classical)</li>
<li>The ultimate goal we can shift more computation into QC, but right now, most of them are done in CC</li>
</ul>
</div>
<div id="outline-container-org728d701" class="outline-4">
<h4 id="org728d701">QPU &amp; CPU partnership</h4>
<div class="outline-text-4" id="text-org728d701">
<ol class="org-ol">
<li>Quantum Computer: Runs your Quantum Circuit</li>
<li>Quantum Computer: Send the results of your circuit to Classical Computer</li>
<li>Classical Computer: Figure out how to modify the circuit</li>
<li>Classical Computer: Send new-instructions to Quantum Computer</li>
<li>Quantum Approximate Optimization Algorithms (QAOA)</li>
<li>Variational Quantum Eigensolver (VQE)</li>
</ol>
</div>
</div>

<div id="outline-container-org6267485" class="outline-4">
<h4 id="org6267485">Problems VQE and QAOA can solve</h4>
<div class="outline-text-4" id="text-org6267485">
<ul class="org-ul">
<li>Constrained Optimization Problems: Find the most optimal solution</li>
<li>The Knapsack problem (the backpack problem) is the most famous problem</li>
<li>The KP is that you are only allowed to bring one backpack. It is up to you to pack the bag most efficiently, given that you can only carry a certain wight and certain volume</li>
<li>You can map the different solutions in discrete values!</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgeb5dbe6" class="outline-3">
<h3 id="orgeb5dbe6">Tunable Quantum Circuits</h3>
<div class="outline-text-3" id="text-orgeb5dbe6">
<ul class="org-ul">
<li>We can implement the possible solutions to different settings of a quantum circuit</li>
<li>For our tunable circuits, we will use tunable gates.</li>
<li>Tuning the circuit to find the most optimal circuit, it&rsquo;s just tuning these gates</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org8e7407a" class="outline-2">
<h2 id="org8e7407a">Resources</h2>
<div class="outline-text-2" id="text-org8e7407a">
<p>
VQE in the Qiskit Textbook: <a href="https://qiskit.org/textbook/ch-applications/vqe-molecules.htm">https://qiskit.org/textbook/ch-applications/vqe-molecules.htm</a>
Introductory Blog post on VQE: <a href="https://www.mustythoughts.com/variational-quantum-eigensolver-explained">https://www.mustythoughts.com/variational-quantum-eigensolver-explained</a>
Blog post on simulating molecules using VQE: <a href="https://towardsdatascience.com/simulated-quantum-computation-of-molecular-energies-using-vqe-c717f8c86b94">https://towardsdatascience.com/simulated-quantum-computation-of-molecular-energies-using-vqe-c717f8c86b94</a>
</p>

<p>
Prof. Michelle Simmons: <a href="https://www.sydneyquantum.org/news/four-brilliant-women-in-quantum-share-stories-on-international-womens-day/">https://www.sydneyquantum.org/news/four-brilliant-women-in-quantum-share-stories-on-international-womens-day/</a>
</p>


<p>
Dr. Hanhee Paik: <a href="https://researcher.watson.ibm.com/researcher/view.php?person=us-hanhee.paik">https://researcher.watson.ibm.com/researcher/view.php?person=us-hanhee.paik</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Luís Spengler</p>
<p class="date">Created: 2022-12-19 Mon 09:48</p>
</div>
</body>
</html>
